target/surefire-reports/TEST-demo.soap.sample.log

15:10:43.471 >> lock acquired, begin callSingle: classpath:demo/headers/common-noheaders.feature
15:10:43.741 request:
1 > GET http://127.0.0.1:54737/headers
1 > Accept-Encoding: gzip,deflate
1 > Connection: Keep-Alive
1 > Host: 127.0.0.1:54737
1 > User-Agent: Apache-HttpClient/4.5.5 (Java/1.8.0_172)

15:10:43.863 response time in milliseconds: 121
1 < 200
1 < Cache-Control: no-cache, no-store, max-age=0, must-revalidate
1 < Content-Length: 36
1 < Content-Type: text/plain;charset=UTF-8
1 < Date: Tue, 24 Jul 2018 09:40:43 GMT
1 < Expires: 0
1 < Pragma: no-cache
1 < Set-Cookie: time=1532425243841
1 < X-Content-Type-Options: nosniff
1 < X-Frame-Options: DENY
1 < X-XSS-Protection: 1; mode=block
e4079e76-0085-4b80-ae8f-01f1ce3bd839

15:10:43.872 << lock released, end callSingle: classpath:demo/headers/common-noheaders.feature
15:10:43.936 request:
1 > POST http://www.dneonline.com/calculator.asmx?op=Add
1 > Accept-Encoding: gzip,deflate
1 > Connection: Keep-Alive
1 > Content-Length: 307
1 > Content-Type: application/soap+xml; charset=UTF-8
1 > Host: www.dneonline.com
1 > User-Agent: Apache-HttpClient/4.5.5 (Java/1.8.0_172)
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"
                 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap12:Body>
      <Add xmlns="http://tempuri.org/">
         <intA>4</intA>
         <intB>2</intB>
      </Add>
   </soap12:Body>
</soap12:Envelope>


15:10:44.435 response time in milliseconds: 494
1 < 200
1 < Cache-Control: private, max-age=0
1 < Content-Length: 323
1 < Content-Type: application/soap+xml; charset=utf-8
1 < Date: Tue, 24 Jul 2018 09:40:42 GMT
1 < Server: Microsoft-IIS/7.5
1 < X-AspNet-Version: 2.0.50727
1 < X-Powered-By: ASP.NET
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap:Body>
      <AddResponse xmlns="http://tempuri.org/">
         <AddResult>6</AddResult>
      </AddResponse>
   </soap:Body>
</soap:Envelope>


15:10:44.485 request:
1 > POST http://www.dneonline.com/calculator.asmx?op=Add
1 > Accept-Encoding: gzip,deflate
1 > Connection: Keep-Alive
1 > Content-Length: 307
1 > Content-Type: application/soap+xml; charset=UTF-8
1 > Host: www.dneonline.com
1 > User-Agent: Apache-HttpClient/4.5.5 (Java/1.8.0_172)
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"
                 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap12:Body>
      <Add xmlns="http://tempuri.org/">
         <intA>6</intA>
         <intB>4</intB>
      </Add>
   </soap12:Body>
</soap12:Envelope>


15:10:44.985 response time in milliseconds: 493
1 < 200
1 < Cache-Control: private, max-age=0
1 < Content-Length: 324
1 < Content-Type: application/soap+xml; charset=utf-8
1 < Date: Tue, 24 Jul 2018 09:40:42 GMT
1 < Server: Microsoft-IIS/7.5
1 < X-AspNet-Version: 2.0.50727
1 < X-Powered-By: ASP.NET
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soap:Body>
      <AddResponse xmlns="http://tempuri.org/">
         <AddResult>10</AddResult>
      </AddResponse>
   </soap:Body>
</soap:Envelope>


="http://tempuri.org/">
         <intA>6</intA>
         <intB>4</intB>
      </Add>
   </soap12:Body>
</soap12:Envelope>


15:05:11.311 response time in milliseconds: 463
1 < 200
1 < Cache-Control: private, max-age=0
1 < Content-Length: 324
1 < Content-Type: application/soap+xml; charset=utf-8
1 < Date: Tue, 24 Jul 2018 09:35:09 GMT
1 < Server: Microsoft-IIS/7.5
1 < X-AspNet-Version: 2.0.50727
1 < X-Powered-By: ASP.NET
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><AddResponse xmlns="http://tempuri.org/"><AddResult>10</AddResult></AddResponse></soap:Body></soap:Envelope>

 /Envelope/Body/AddResponse/AddResult, actual: '6', expected: '8', reason: not equal
xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><AddResponse xmlns="http://tempuri.org/"><AddResult>0</AddResult></AddResponse></soap:Body></soap:Envelope>

14:30:32.878 assertion failed: path: /Envelope/Body/AddResponse/AddResult, actual: '0', expected: '8', reason: not equal
    </Add>
   </soap12:Body>
   <Add>
      <intA>2</intA>
   </Add>
   <Add>
      <intA>3</intA>
   </Add>
   <Add>
      <intB>4</intB>
   </Add>
   <Add>
      <intB>4</intB>
   </Add>
</soap12:Envelope>

14:29:36.537 request:
1 > POST http://www.dneonline.com/calculator.asmx?op=Add
1 > Accept-Encoding: gzip,deflate
1 > Connection: Keep-Alive
1 > Content-Length: 369
1 > Content-Type: application/soap+xml; charset=UTF-8
1 > Host: www.dneonline.com
1 > User-Agent: Apache-HttpClient/4.5.5 (Java/1.8.0_172)
<soap12:Envelope xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soap12:Body><Add xmlns="http://tempuri.org/"><intA/><intB/></Add></soap12:Body><Add><intA>2</intA></Add><Add><intA>3</intA></Add><Add><intB>4</intB></Add><Add><intB>4</intB></Add></soap12:Envelope>

14:29:37.024 response time in milliseconds: 486
1 < 500
1 < Cache-Control: private
1 < Content-Length: 1813
1 < Content-Type: application/soap+xml; charset=utf-8
1 < Date: Tue, 24 Jul 2018 08:59:35 GMT
1 < Server: Microsoft-IIS/7.5
1 < X-AspNet-Version: 2.0.50727
1 < X-Powered-By: ASP.NET
<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><soap:Fault><soap:Code><soap:Value>soap:Sender</soap:Value></soap:Code><soap:Reason><soap:Text xml:lang="en">System.Web.Services.Protocols.SoapException: Server was unable to read request. ---&gt; System.InvalidOperationException: There is an error in XML document (1, 226). ---&gt; System.FormatException: Input string was not in a correct format.
   at System.Number.StringToNumber(String str, NumberStyles options, NumberBuffer&amp; number, NumberFormatInfo info, Boolean parseDecimal)
   at System.Number.ParseInt32(String s, NumberStyles style, NumberFormatInfo info)
   at System.Xml.XmlConvert.ToInt32(String s)
   at Microsoft.Xml.Serialization.GeneratedAssembly.XmlSerializationReader1.Read1_Add()
   at Microsoft.Xml.Serialization.GeneratedAssembly.ArrayOfObjectSerializer.Deserialize(XmlSerializationReader reader)
   at System.Xml.Serialization.XmlSerializer.Deserialize(XmlReader xmlReader, String encodingStyle, XmlDeserializationEvents events)
   --- End of inner exception stack trace ---
   at System.Xml.Serialization.XmlSerializer.Deserialize(XmlReader xmlReader, String encodingStyle, XmlDeserializationEvents events)
   at System.Xml.Serialization.XmlSerializer.Deserialize(XmlReader xmlReader, String encodingStyle)
   at System.Web.Services.Protocols.SoapServerProtocol.ReadParameters()
   --- End of inner exception stack trace ---
   at System.Web.Services.Protocols.SoapServerProtocol.ReadParameters()
   at System.Web.Services.Protocols.WebServiceHandler.CoreProcessRequest()</soap:Text></soap:Reason><soap:Detail /></soap:Fault></soap:Body></soap:Envelope>

14:29:37.039 assertion failed: path: /Envelope/Body/AddResponse/AddResult, actual: null, expected: '8', reason: actual xpath does not exist
